{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import os\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from tqdm import tqdm\n",
    "import numpy as np\n",
    "import re\n",
    "\n",
    "pd.set_option('display.max_columns', 500)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\vism\\AppData\\Local\\Temp\\ipykernel_3420\\1714904036.py:1: DtypeWarning: Columns (2) have mixed types. Specify dtype option on import or set low_memory=False.\n",
      "  raw_requests = pd.read_csv('rules_data.csv')\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>timestamp [UTC]</th>\n",
       "      <th>id</th>\n",
       "      <th>source</th>\n",
       "      <th>name</th>\n",
       "      <th>url</th>\n",
       "      <th>success</th>\n",
       "      <th>resultCode</th>\n",
       "      <th>duration</th>\n",
       "      <th>performanceBucket</th>\n",
       "      <th>itemType</th>\n",
       "      <th>customDimensions</th>\n",
       "      <th>customMeasurements</th>\n",
       "      <th>operation_Name</th>\n",
       "      <th>operation_Id</th>\n",
       "      <th>operation_ParentId</th>\n",
       "      <th>operation_SyntheticSource</th>\n",
       "      <th>session_Id</th>\n",
       "      <th>user_Id</th>\n",
       "      <th>user_AuthenticatedId</th>\n",
       "      <th>user_AccountId</th>\n",
       "      <th>application_Version</th>\n",
       "      <th>client_Type</th>\n",
       "      <th>client_Model</th>\n",
       "      <th>client_OS</th>\n",
       "      <th>client_IP</th>\n",
       "      <th>client_City</th>\n",
       "      <th>client_StateOrProvince</th>\n",
       "      <th>client_CountryOrRegion</th>\n",
       "      <th>client_Browser</th>\n",
       "      <th>cloud_RoleName</th>\n",
       "      <th>cloud_RoleInstance</th>\n",
       "      <th>appId</th>\n",
       "      <th>appName</th>\n",
       "      <th>iKey</th>\n",
       "      <th>sdkVersion</th>\n",
       "      <th>itemId</th>\n",
       "      <th>itemCount</th>\n",
       "      <th>_ResourceId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>12/7/2024, 2:12:47.609 pm</td>\n",
       "      <td>cc286184c6d9b7c9</td>\n",
       "      <td>cid-v1:443108a7-2c63-4025-90d6-483f3023e351</td>\n",
       "      <td>POST Rules/Rules</td>\n",
       "      <td>http://rules-api-service.rules.svc.cluster.loc...</td>\n",
       "      <td>True</td>\n",
       "      <td>200</td>\n",
       "      <td>1424.3322</td>\n",
       "      <td>1sec-3sec</td>\n",
       "      <td>request</td>\n",
       "      <td>{\"X-Parent-Source\":\"V4\",\"CompanyContext\":\"CDNV...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>POST Rules/Rules</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>73c2f42cf4fa3ee9</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>6.0.32</td>\n",
       "      <td>PC</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.0.0.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>rules-api</td>\n",
       "      <td>rules-api-deployment-7548b55df9-5q74p</td>\n",
       "      <td>f3c32fb8-ed5e-4045-b519-12e185ca365d</td>\n",
       "      <td>/subscriptions/a6b95c4d-8f36-4107-a2e9-272007e...</td>\n",
       "      <td>db9cf7b1-a381-4315-ae3e-fdcf9a827987</td>\n",
       "      <td>ai-k8s:6.1.1.0</td>\n",
       "      <td>e8ecf2ac-4058-11ef-94c0-00224809857f</td>\n",
       "      <td>1</td>\n",
       "      <td>/subscriptions/a6b95c4d-8f36-4107-a2e9-272007e...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             timestamp [UTC]                id  \\\n",
       "0  12/7/2024, 2:12:47.609 pm  cc286184c6d9b7c9   \n",
       "\n",
       "                                        source              name  \\\n",
       "0  cid-v1:443108a7-2c63-4025-90d6-483f3023e351  POST Rules/Rules   \n",
       "\n",
       "                                                 url  success  resultCode  \\\n",
       "0  http://rules-api-service.rules.svc.cluster.loc...     True         200   \n",
       "\n",
       "    duration performanceBucket itemType  \\\n",
       "0  1424.3322         1sec-3sec  request   \n",
       "\n",
       "                                    customDimensions customMeasurements  \\\n",
       "0  {\"X-Parent-Source\":\"V4\",\"CompanyContext\":\"CDNV...                NaN   \n",
       "\n",
       "     operation_Name                      operation_Id operation_ParentId  \\\n",
       "0  POST Rules/Rules  8ff8696695aa73588ac454809741e2ea   73c2f42cf4fa3ee9   \n",
       "\n",
       "   operation_SyntheticSource  session_Id  user_Id  user_AuthenticatedId  \\\n",
       "0                        NaN         NaN      NaN                   NaN   \n",
       "\n",
       "   user_AccountId application_Version client_Type  client_Model  client_OS  \\\n",
       "0             NaN              6.0.32          PC           NaN        NaN   \n",
       "\n",
       "  client_IP client_City client_StateOrProvince client_CountryOrRegion  \\\n",
       "0   0.0.0.0         NaN                    NaN                    NaN   \n",
       "\n",
       "   client_Browser cloud_RoleName                     cloud_RoleInstance  \\\n",
       "0             NaN      rules-api  rules-api-deployment-7548b55df9-5q74p   \n",
       "\n",
       "                                  appId  \\\n",
       "0  f3c32fb8-ed5e-4045-b519-12e185ca365d   \n",
       "\n",
       "                                             appName  \\\n",
       "0  /subscriptions/a6b95c4d-8f36-4107-a2e9-272007e...   \n",
       "\n",
       "                                   iKey      sdkVersion  \\\n",
       "0  db9cf7b1-a381-4315-ae3e-fdcf9a827987  ai-k8s:6.1.1.0   \n",
       "\n",
       "                                 itemId  itemCount  \\\n",
       "0  e8ecf2ac-4058-11ef-94c0-00224809857f          1   \n",
       "\n",
       "                                         _ResourceId  \n",
       "0  /subscriptions/a6b95c4d-8f36-4107-a2e9-272007e...  "
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "raw_requests = pd.read_csv('rules_data.csv')\n",
    "raw_requests.head(1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>timestamp [UTC]</th>\n",
       "      <th>name</th>\n",
       "      <th>url</th>\n",
       "      <th>duration</th>\n",
       "      <th>customDimensions</th>\n",
       "      <th>operation_Id</th>\n",
       "      <th>operation_ParentId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>cc286184c6d9b7c9</td>\n",
       "      <td>12/7/2024, 2:12:47.609 pm</td>\n",
       "      <td>POST Rules/Rules</td>\n",
       "      <td>http://rules-api-service.rules.svc.cluster.loc...</td>\n",
       "      <td>1424.3322</td>\n",
       "      <td>{\"X-Parent-Source\":\"V4\",\"CompanyContext\":\"CDNV...</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>73c2f42cf4fa3ee9</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 id            timestamp [UTC]              name  \\\n",
       "0  cc286184c6d9b7c9  12/7/2024, 2:12:47.609 pm  POST Rules/Rules   \n",
       "\n",
       "                                                 url   duration  \\\n",
       "0  http://rules-api-service.rules.svc.cluster.loc...  1424.3322   \n",
       "\n",
       "                                    customDimensions  \\\n",
       "0  {\"X-Parent-Source\":\"V4\",\"CompanyContext\":\"CDNV...   \n",
       "\n",
       "                       operation_Id operation_ParentId  \n",
       "0  8ff8696695aa73588ac454809741e2ea   73c2f42cf4fa3ee9  "
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# select only required columns\n",
    "df_requests = raw_requests[['id', 'timestamp [UTC]', 'name', 'url', 'duration', 'customDimensions', 'operation_Id', 'operation_ParentId']]\n",
    "# measure at APIM level\n",
    "df_requests = df_requests[df_requests['name'] == 'POST Rules/Rules']\n",
    "df_requests.head(1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "count      4420.000000\n",
       "mean       4425.952405\n",
       "std       12562.126106\n",
       "min         125.303000\n",
       "50%         544.901550\n",
       "75%        1317.375575\n",
       "90%       10225.018560\n",
       "95%       24079.596710\n",
       "99%       70053.827974\n",
       "max      110924.389400\n",
       "Name: duration, dtype: float64"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_requests['duration'].describe(percentiles=[0.5, 0.75, 0.9, 0.95, 0.99])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of unique operation ids: 1346\n",
      "Example operation id: 8ff8696695aa73588ac454809741e2ea\n"
     ]
    }
   ],
   "source": [
    "operation_ids = df_requests[df_requests['duration'] > 1000]['operation_Id'].unique()\n",
    "print(f'Number of unique operation ids: {len(operation_ids)}')\n",
    "op_id = operation_ids[0]\n",
    "print(f'Example operation id: {op_id}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of unique operation ids: 380\n"
     ]
    }
   ],
   "source": [
    "raw_dependencies = pd.read_csv('query_data (33).csv')\n",
    "raw_dependencies.head(1)\n",
    "print(f'Number of unique operation ids: {len(raw_dependencies[\"operation_Id\"].unique())}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "68\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>timestamp [UTC]</th>\n",
       "      <th>id</th>\n",
       "      <th>operation_Id</th>\n",
       "      <th>itemType</th>\n",
       "      <th>operation_ParentId</th>\n",
       "      <th>operation_Name</th>\n",
       "      <th>iKey</th>\n",
       "      <th>duration</th>\n",
       "      <th>type</th>\n",
       "      <th>name</th>\n",
       "      <th>cloud_RoleInstance</th>\n",
       "      <th>o_count</th>\n",
       "      <th>cloud_RoleName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>12/7/2024, 2:12:47.188 pm</td>\n",
       "      <td>72d50ef82523b6dd</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>request</td>\n",
       "      <td>|c271aa9f-465a15e0b465d34e.c271aaa1_</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "      <td>545301b3-f114-4865-9afa-0ca19c1d142b</td>\n",
       "      <td>1868.0681</td>\n",
       "      <td>NaN</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "      <td>v4-api-deployment-897595574-ksg78</td>\n",
       "      <td>68</td>\n",
       "      <td>v4-api</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>114</th>\n",
       "      <td>12/7/2024, 2:12:47.263 pm</td>\n",
       "      <td>e5bc78812019f353</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>dependency</td>\n",
       "      <td>72d50ef82523b6dd</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "      <td>545301b3-f114-4865-9afa-0ca19c1d142b</td>\n",
       "      <td>34.0293</td>\n",
       "      <td>Http (tracked component)</td>\n",
       "      <td>POST /api/readallcentralrecords-func</td>\n",
       "      <td>v4-api-deployment-897595574-ksg78</td>\n",
       "      <td>68</td>\n",
       "      <td>v4-api</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>101</th>\n",
       "      <td>12/7/2024, 2:12:47.271 pm</td>\n",
       "      <td>171e6a3358258d98</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>request</td>\n",
       "      <td>e5bc78812019f353</td>\n",
       "      <td>readallcentralrecords-func</td>\n",
       "      <td>db9cf7b1-a381-4315-ae3e-fdcf9a827987</td>\n",
       "      <td>22.0563</td>\n",
       "      <td>NaN</td>\n",
       "      <td>readallcentralrecords-func</td>\n",
       "      <td>b06e57d8b1788d9a42542c457af7292942644db9c4e4e5...</td>\n",
       "      <td>68</td>\n",
       "      <td>core-func-shift-perf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>113</th>\n",
       "      <td>12/7/2024, 2:12:47.306 pm</td>\n",
       "      <td>c0af2c3968b30c11</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>dependency</td>\n",
       "      <td>72d50ef82523b6dd</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "      <td>545301b3-f114-4865-9afa-0ca19c1d142b</td>\n",
       "      <td>35.3667</td>\n",
       "      <td>Http (tracked component)</td>\n",
       "      <td>POST /api/updatecentralrecord-func</td>\n",
       "      <td>v4-api-deployment-897595574-ksg78</td>\n",
       "      <td>68</td>\n",
       "      <td>v4-api</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>100</th>\n",
       "      <td>12/7/2024, 2:12:47.308 pm</td>\n",
       "      <td>09bfd5ea5809c919</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>request</td>\n",
       "      <td>c0af2c3968b30c11</td>\n",
       "      <td>updatecentralrecord-func</td>\n",
       "      <td>db9cf7b1-a381-4315-ae3e-fdcf9a827987</td>\n",
       "      <td>29.6672</td>\n",
       "      <td>NaN</td>\n",
       "      <td>updatecentralrecord-func</td>\n",
       "      <td>b06e57d8b1788d9a42542c457af7292942644db9c4e4e5...</td>\n",
       "      <td>68</td>\n",
       "      <td>core-func-shift-perf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>12/7/2024, 2:12:48.658 pm</td>\n",
       "      <td>101ef37a45739b6b</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>dependency</td>\n",
       "      <td>099f6312827883be</td>\n",
       "      <td>POST PayRate/GetPayRate</td>\n",
       "      <td>db9cf7b1-a381-4315-ae3e-fdcf9a827987</td>\n",
       "      <td>353.8294</td>\n",
       "      <td>HTTP</td>\n",
       "      <td>POST /660a9f76-9ac1-4994-afd2-45b6747006b3/oau...</td>\n",
       "      <td>payroll-api-deployment-5dfd85c476-whbx2</td>\n",
       "      <td>68</td>\n",
       "      <td>payroll-api</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>12/7/2024, 2:12:48.672 pm</td>\n",
       "      <td>1fb6d6947137e812</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>request</td>\n",
       "      <td>36ec5e41417cf150</td>\n",
       "      <td>readallcentralrecords-multipleparticipant-func</td>\n",
       "      <td>db9cf7b1-a381-4315-ae3e-fdcf9a827987</td>\n",
       "      <td>19.0265</td>\n",
       "      <td>NaN</td>\n",
       "      <td>readallcentralrecords-multipleparticipant-func</td>\n",
       "      <td>62231f4a8d0b0c0d9e2ea445516fe9bb14f36ceec9b723...</td>\n",
       "      <td>68</td>\n",
       "      <td>core-func-shift-perf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>12/7/2024, 2:12:48.697 pm</td>\n",
       "      <td>7dd17bb947d313cf</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>dependency</td>\n",
       "      <td>d7f42d34650a0595</td>\n",
       "      <td>POST Rules/GetPayrollRulesData</td>\n",
       "      <td>db9cf7b1-a381-4315-ae3e-fdcf9a827987</td>\n",
       "      <td>195.2058</td>\n",
       "      <td>HTTP</td>\n",
       "      <td>POST /660a9f76-9ac1-4994-afd2-45b6747006b3/oau...</td>\n",
       "      <td>payroll-api-deployment-5dfd85c476-lcwwv</td>\n",
       "      <td>68</td>\n",
       "      <td>payroll-api</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>120</th>\n",
       "      <td>12/7/2024, 2:12:48.895 pm</td>\n",
       "      <td>724b4cb182c94f0098007fb9a5b89a07</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>dependency</td>\n",
       "      <td>f60cc08d2b4a16ad</td>\n",
       "      <td>POST Rules/GetPayrollRulesData</td>\n",
       "      <td>db9cf7b1-a381-4315-ae3e-fdcf9a827987</td>\n",
       "      <td>2.8843</td>\n",
       "      <td>SQL</td>\n",
       "      <td>SQL: tcp:u2-sql-perf.database.windows.net,1433...</td>\n",
       "      <td>payroll-api-deployment-5dfd85c476-lcwwv</td>\n",
       "      <td>68</td>\n",
       "      <td>payroll-api</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>12/7/2024, 2:12:49.014 pm</td>\n",
       "      <td>aed23de9cda74190adf600cd2d35d35a</td>\n",
       "      <td>8ff8696695aa73588ac454809741e2ea</td>\n",
       "      <td>dependency</td>\n",
       "      <td>eb1cb2e366ea655d</td>\n",
       "      <td>POST PayRate/GetPayRate</td>\n",
       "      <td>db9cf7b1-a381-4315-ae3e-fdcf9a827987</td>\n",
       "      <td>0.4655</td>\n",
       "      <td>SQL</td>\n",
       "      <td>SQL: tcp:u2-sql-perf.database.windows.net,1433...</td>\n",
       "      <td>payroll-api-deployment-5dfd85c476-whbx2</td>\n",
       "      <td>68</td>\n",
       "      <td>payroll-api</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>68 rows × 13 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               timestamp [UTC]                                id  \\\n",
       "122  12/7/2024, 2:12:47.188 pm                  72d50ef82523b6dd   \n",
       "114  12/7/2024, 2:12:47.263 pm                  e5bc78812019f353   \n",
       "101  12/7/2024, 2:12:47.271 pm                  171e6a3358258d98   \n",
       "113  12/7/2024, 2:12:47.306 pm                  c0af2c3968b30c11   \n",
       "100  12/7/2024, 2:12:47.308 pm                  09bfd5ea5809c919   \n",
       "..                         ...                               ...   \n",
       "76   12/7/2024, 2:12:48.658 pm                  101ef37a45739b6b   \n",
       "94   12/7/2024, 2:12:48.672 pm                  1fb6d6947137e812   \n",
       "121  12/7/2024, 2:12:48.697 pm                  7dd17bb947d313cf   \n",
       "120  12/7/2024, 2:12:48.895 pm  724b4cb182c94f0098007fb9a5b89a07   \n",
       "75   12/7/2024, 2:12:49.014 pm  aed23de9cda74190adf600cd2d35d35a   \n",
       "\n",
       "                         operation_Id    itemType  \\\n",
       "122  8ff8696695aa73588ac454809741e2ea     request   \n",
       "114  8ff8696695aa73588ac454809741e2ea  dependency   \n",
       "101  8ff8696695aa73588ac454809741e2ea     request   \n",
       "113  8ff8696695aa73588ac454809741e2ea  dependency   \n",
       "100  8ff8696695aa73588ac454809741e2ea     request   \n",
       "..                                ...         ...   \n",
       "76   8ff8696695aa73588ac454809741e2ea  dependency   \n",
       "94   8ff8696695aa73588ac454809741e2ea     request   \n",
       "121  8ff8696695aa73588ac454809741e2ea  dependency   \n",
       "120  8ff8696695aa73588ac454809741e2ea  dependency   \n",
       "75   8ff8696695aa73588ac454809741e2ea  dependency   \n",
       "\n",
       "                       operation_ParentId  \\\n",
       "122  |c271aa9f-465a15e0b465d34e.c271aaa1_   \n",
       "114                      72d50ef82523b6dd   \n",
       "101                      e5bc78812019f353   \n",
       "113                      72d50ef82523b6dd   \n",
       "100                      c0af2c3968b30c11   \n",
       "..                                    ...   \n",
       "76                       099f6312827883be   \n",
       "94                       36ec5e41417cf150   \n",
       "121                      d7f42d34650a0595   \n",
       "120                      f60cc08d2b4a16ad   \n",
       "75                       eb1cb2e366ea655d   \n",
       "\n",
       "                                     operation_Name  \\\n",
       "122                 POST Timesheet/SubmitShiftEntry   \n",
       "114                 POST Timesheet/SubmitShiftEntry   \n",
       "101                      readallcentralrecords-func   \n",
       "113                 POST Timesheet/SubmitShiftEntry   \n",
       "100                        updatecentralrecord-func   \n",
       "..                                              ...   \n",
       "76                          POST PayRate/GetPayRate   \n",
       "94   readallcentralrecords-multipleparticipant-func   \n",
       "121                  POST Rules/GetPayrollRulesData   \n",
       "120                  POST Rules/GetPayrollRulesData   \n",
       "75                          POST PayRate/GetPayRate   \n",
       "\n",
       "                                     iKey   duration  \\\n",
       "122  545301b3-f114-4865-9afa-0ca19c1d142b  1868.0681   \n",
       "114  545301b3-f114-4865-9afa-0ca19c1d142b    34.0293   \n",
       "101  db9cf7b1-a381-4315-ae3e-fdcf9a827987    22.0563   \n",
       "113  545301b3-f114-4865-9afa-0ca19c1d142b    35.3667   \n",
       "100  db9cf7b1-a381-4315-ae3e-fdcf9a827987    29.6672   \n",
       "..                                    ...        ...   \n",
       "76   db9cf7b1-a381-4315-ae3e-fdcf9a827987   353.8294   \n",
       "94   db9cf7b1-a381-4315-ae3e-fdcf9a827987    19.0265   \n",
       "121  db9cf7b1-a381-4315-ae3e-fdcf9a827987   195.2058   \n",
       "120  db9cf7b1-a381-4315-ae3e-fdcf9a827987     2.8843   \n",
       "75   db9cf7b1-a381-4315-ae3e-fdcf9a827987     0.4655   \n",
       "\n",
       "                         type  \\\n",
       "122                       NaN   \n",
       "114  Http (tracked component)   \n",
       "101                       NaN   \n",
       "113  Http (tracked component)   \n",
       "100                       NaN   \n",
       "..                        ...   \n",
       "76                       HTTP   \n",
       "94                        NaN   \n",
       "121                      HTTP   \n",
       "120                       SQL   \n",
       "75                        SQL   \n",
       "\n",
       "                                                  name  \\\n",
       "122                    POST Timesheet/SubmitShiftEntry   \n",
       "114               POST /api/readallcentralrecords-func   \n",
       "101                         readallcentralrecords-func   \n",
       "113                 POST /api/updatecentralrecord-func   \n",
       "100                           updatecentralrecord-func   \n",
       "..                                                 ...   \n",
       "76   POST /660a9f76-9ac1-4994-afd2-45b6747006b3/oau...   \n",
       "94      readallcentralrecords-multipleparticipant-func   \n",
       "121  POST /660a9f76-9ac1-4994-afd2-45b6747006b3/oau...   \n",
       "120  SQL: tcp:u2-sql-perf.database.windows.net,1433...   \n",
       "75   SQL: tcp:u2-sql-perf.database.windows.net,1433...   \n",
       "\n",
       "                                    cloud_RoleInstance  o_count  \\\n",
       "122                  v4-api-deployment-897595574-ksg78       68   \n",
       "114                  v4-api-deployment-897595574-ksg78       68   \n",
       "101  b06e57d8b1788d9a42542c457af7292942644db9c4e4e5...       68   \n",
       "113                  v4-api-deployment-897595574-ksg78       68   \n",
       "100  b06e57d8b1788d9a42542c457af7292942644db9c4e4e5...       68   \n",
       "..                                                 ...      ...   \n",
       "76             payroll-api-deployment-5dfd85c476-whbx2       68   \n",
       "94   62231f4a8d0b0c0d9e2ea445516fe9bb14f36ceec9b723...       68   \n",
       "121            payroll-api-deployment-5dfd85c476-lcwwv       68   \n",
       "120            payroll-api-deployment-5dfd85c476-lcwwv       68   \n",
       "75             payroll-api-deployment-5dfd85c476-whbx2       68   \n",
       "\n",
       "           cloud_RoleName  \n",
       "122                v4-api  \n",
       "114                v4-api  \n",
       "101  core-func-shift-perf  \n",
       "113                v4-api  \n",
       "100  core-func-shift-perf  \n",
       "..                    ...  \n",
       "76            payroll-api  \n",
       "94   core-func-shift-perf  \n",
       "121           payroll-api  \n",
       "120           payroll-api  \n",
       "75            payroll-api  \n",
       "\n",
       "[68 rows x 13 columns]"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "t = []\n",
    "df_dep = pd.DataFrame()\n",
    "# for op_id in operation_ids.take(1):\n",
    "service_dep_graph = raw_dependencies[raw_dependencies['operation_Id'] == op_id].sort_values('timestamp [UTC]', ascending=True)\n",
    "print(len(service_dep_graph))\n",
    "service_dep_graph.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [],
   "source": [
    "os.environ[\"NEO4J_URI\"] = \"bolt://localhost:7687\"\n",
    "os.environ[\"NEO4J_USERNAME\"] = \"neo4j\"\n",
    "os.environ[\"NEO4J_PASSWORD\"] = \"Password@123\"\n",
    "graph = Neo4jGraph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 80,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# clear the graph\n",
    "graph.query('MATCH (n) DETACH DELETE n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of nodes: 8\n"
     ]
    }
   ],
   "source": [
    "# add nodes\n",
    "# TO DO: batch insert\n",
    "nodes = service_dep_graph['cloud_RoleName'].unique()\n",
    "print(f'Number of nodes: {len(nodes)}')\n",
    "nodes = list({'id': node} for node in nodes)\n",
    "nodes.append({'id': 'ROOT'})\n",
    "for node in nodes:\n",
    "  query = f\"CREATE (a:Node {{id: '{node['id']}'}})\"\n",
    "  graph.query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of edges: 68\n"
     ]
    }
   ],
   "source": [
    "# add edges\n",
    "counter = 0\n",
    "for index, row in service_dep_graph.iterrows():\n",
    "  # get the node\n",
    "  cloud_RoleInstance = row['cloud_RoleInstance']\n",
    "  id = row['id']\n",
    "  operation_ParentId = row['operation_ParentId']\n",
    "  duration = row['duration']\n",
    "  itemType = row['itemType']\n",
    "  operation_Name = row['operation_Name']\n",
    "  # find the parent node\n",
    "  parents = service_dep_graph[service_dep_graph['id'] == operation_ParentId]['cloud_RoleName'][:1]\n",
    "  parent_node = None\n",
    "  if len(parents) > 0:\n",
    "    parent_node = parents.values[0]\n",
    "  else:\n",
    "    parent_node = \"ROOT\"\n",
    "  # find the child node\n",
    "  child_node = service_dep_graph[service_dep_graph['id'] == id]['cloud_RoleName'][:1].values[0]\n",
    "  # create edge with id as child and operation_ParentId as parent\n",
    "  if parent_node and child_node:\n",
    "    query = f\"MATCH (a:Node {{id: '{parent_node}'}}), (b:Node {{id: '{child_node}'}}) CREATE (a)-[r:DEPENDS_ON {{duration: {duration}, itemType: '{itemType}', counter: {counter}, operation_Name: '{operation_Name}', cloud_roleInstance: '{cloud_RoleInstance}'}}]->(b) RETURN r\"\n",
    "    result = graph.query(query)\n",
    "    if len(result) == 0:\n",
    "      print(f'Error: {query}')\n",
    "    # print(query)\n",
    "    counter += 1\n",
    "print(f'Number of edges: {counter}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'n.id': 'v4-api', 'r.duration': 1437.8613, 'm.id': 'v4-api'}\n",
      "Total Duration: {'sum(r.duration)': 13523.023400000004}\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.id</th>\n",
       "      <th>r.duration</th>\n",
       "      <th>r.counter</th>\n",
       "      <th>m.id</th>\n",
       "      <th>r.operation_Name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ROOT</td>\n",
       "      <td>1868.0681</td>\n",
       "      <td>0</td>\n",
       "      <td>v4-api</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>v4-api</td>\n",
       "      <td>34.0293</td>\n",
       "      <td>1</td>\n",
       "      <td>v4-api</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>v4-api</td>\n",
       "      <td>22.0563</td>\n",
       "      <td>2</td>\n",
       "      <td>core-func-shift-perf</td>\n",
       "      <td>readallcentralrecords-func</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>v4-api</td>\n",
       "      <td>35.3667</td>\n",
       "      <td>3</td>\n",
       "      <td>v4-api</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>v4-api</td>\n",
       "      <td>29.6672</td>\n",
       "      <td>4</td>\n",
       "      <td>core-func-shift-perf</td>\n",
       "      <td>updatecentralrecord-func</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>v4-api</td>\n",
       "      <td>26.3562</td>\n",
       "      <td>5</td>\n",
       "      <td>v4-api</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>v4-api</td>\n",
       "      <td>18.8664</td>\n",
       "      <td>6</td>\n",
       "      <td>core-func-shift-perf</td>\n",
       "      <td>readallcentralrecords-func</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>v4-api</td>\n",
       "      <td>27.8329</td>\n",
       "      <td>7</td>\n",
       "      <td>v4-api</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>v4-api</td>\n",
       "      <td>16.8676</td>\n",
       "      <td>8</td>\n",
       "      <td>core-func-shift-perf</td>\n",
       "      <td>readcentralrecord-func</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ROOT</td>\n",
       "      <td>137.2139</td>\n",
       "      <td>9</td>\n",
       "      <td>v4-api</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     n.id  r.duration  r.counter                  m.id  \\\n",
       "0    ROOT   1868.0681          0                v4-api   \n",
       "1  v4-api     34.0293          1                v4-api   \n",
       "2  v4-api     22.0563          2  core-func-shift-perf   \n",
       "3  v4-api     35.3667          3                v4-api   \n",
       "4  v4-api     29.6672          4  core-func-shift-perf   \n",
       "5  v4-api     26.3562          5                v4-api   \n",
       "6  v4-api     18.8664          6  core-func-shift-perf   \n",
       "7  v4-api     27.8329          7                v4-api   \n",
       "8  v4-api     16.8676          8  core-func-shift-perf   \n",
       "9    ROOT    137.2139          9                v4-api   \n",
       "\n",
       "                  r.operation_Name  \n",
       "0  POST Timesheet/SubmitShiftEntry  \n",
       "1  POST Timesheet/SubmitShiftEntry  \n",
       "2       readallcentralrecords-func  \n",
       "3  POST Timesheet/SubmitShiftEntry  \n",
       "4         updatecentralrecord-func  \n",
       "5  POST Timesheet/SubmitShiftEntry  \n",
       "6       readallcentralrecords-func  \n",
       "7  POST Timesheet/SubmitShiftEntry  \n",
       "8           readcentralrecord-func  \n",
       "9  POST Timesheet/SubmitShiftEntry  "
      ]
     },
     "execution_count": 83,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# validation\n",
    "\n",
    "# get edges\n",
    "query = \"MATCH (n:Node)-[r:DEPENDS_ON]->(m:Node) RETURN n.id, r.duration, m.id\"\n",
    "result = graph.query(query)\n",
    "print(result[0])\n",
    "\n",
    "# get total duration\n",
    "query = \"MATCH (n:Node)-[r:DEPENDS_ON]->(m:Node) RETURN sum(r.duration)\"\n",
    "result = graph.query(query)\n",
    "print(f\"Total Duration: {result[0]}\")\n",
    "\n",
    "# order by counter\n",
    "query = \"MATCH (n:Node)-[r:DEPENDS_ON]->(m:Node) RETURN n.id, r.duration, r.counter, m.id, r.operation_Name ORDER BY r.counter asc\"\n",
    "result = pd.DataFrame.from_records(graph.query(query))\n",
    "result.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.id</th>\n",
       "      <th>r.duration</th>\n",
       "      <th>r.operation_Name</th>\n",
       "      <th>m.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ROOT</td>\n",
       "      <td>1868.0681</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "      <td>v4-api</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>v4-api</td>\n",
       "      <td>1437.8613</td>\n",
       "      <td>POST Timesheet/SubmitShiftEntry</td>\n",
       "      <td>v4-api</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>v4-api</td>\n",
       "      <td>1424.3322</td>\n",
       "      <td>POST Rules/Rules</td>\n",
       "      <td>rules-api</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     n.id  r.duration                 r.operation_Name       m.id\n",
       "0    ROOT   1868.0681  POST Timesheet/SubmitShiftEntry     v4-api\n",
       "1  v4-api   1437.8613  POST Timesheet/SubmitShiftEntry     v4-api\n",
       "2  v4-api   1424.3322                 POST Rules/Rules  rules-api"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get longest path by duration attribute in the edge, excluding root\n",
    "query = \"MATCH (n:Node)-[r:DEPENDS_ON]->(m:Node) where n.id <> 'ROOT' OR m.id <> 'ROOT' RETURN n.id, r.duration, r.operation_Name, m.id ORDER BY r.duration DESC LIMIT 3\"\n",
    "result = graph.query(query)\n",
    "for r in result[1:]:\n",
    "    # update the edge with a new attribute\n",
    "    query = f\"MATCH (n:Node)-[r:DEPENDS_ON]->(m:Node) WHERE n.id = '{r['n.id']}' AND m.id = '{r['m.id']}' SET r.longest_path = true\"\n",
    "    graph.query(query)\n",
    "pd.DataFrame.from_records(result).head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
